a = "109"
n = ["2", "3", "4", "5", "6", "7", "8", "9"]
ch = ""
q = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
w = ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
e = ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
r = ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
i = len(a)
if i==4:
    print("тысяча")
elif i==3:
    if a[2] == "0":
        if a[1]== "0":
            ch = r[int(a[0])-1]
        else:
            ch = r[int(a[0])-1] + " " + e[int(a[1])-1]
    else:
        if a[1] =="1":
            ch = r[int(a[0])-1] + " " + w[int(a[2])-1]
        elif a[1] in n:
            ch += r[int(a[0])-1] + " " + e[int(a[1])-1] + " " + q[int(a[2])-1]
        else:
            ch += r[int(a[0])-1] + " " + q[int(a[2]) - 1]
elif i==2:
    if a[1] == "0":
        ch = e[int(a[0]) - 1]
    else:
        if a[0] == "1":
            ch += w[int(a[1])-1]
        elif a[0] in n:
            ch += e[int(a[0])-1] + " " + q[int(a[1])-1]
        else:
            ch += q[int(a[1]) - 1]
else:
    ch += q[int(a[0]) - 1]

print(ch)